tests/Chisel.Tests/DependencyGraphTest.MongoDbGraph_writeIgnoredPackages=False_format=mermaid.verified.mmd
%% Generated by https://github.com/0xced/Chisel

graph LR

classDef default fill:aquamarine,stroke:#009061,color:#333333
classDef removed fill:lightcoral,stroke:#A42A2A

AWSSDK.SecurityToken --> AWSSDK.Core
ByteSize
DnsClient --> Microsoft.Win32.Registry
Microsoft.Extensions.Logging.Abstractions --> Microsoft.Extensions.DependencyInjection.Abstractions
Microsoft.Win32.Registry --> System.Security.AccessControl
Microsoft.Win32.Registry --> System.Security.Principal.Windows
MongoDB.Bson --> System.Runtime.CompilerServices.Unsafe
MongoDB.Driver --> Microsoft.Extensions.Logging.Abstractions
MongoDB.Driver --> MongoDB.Bson
MongoDB.Driver --> MongoDB.Driver.Core
MongoDB.Driver --> MongoDB.Libmongocrypt
MongoDB.Driver.Core --> AWSSDK.SecurityToken
MongoDB.Driver.Core --> DnsClient
MongoDB.Driver.Core --> Microsoft.Extensions.Logging.Abstractions
MongoDB.Driver.Core --> MongoDB.Bson
MongoDB.Driver.Core --> MongoDB.Libmongocrypt
MongoDB.Driver.Core --> SharpCompress
MongoDB.Driver.Core --> Snappier
MongoDB.Driver.Core --> ZstdSharp.Port
System.Security.AccessControl --> System.Security.Principal.Windows

class AWSSDK.Core removed
class AWSSDK.SecurityToken removed
class ByteSize default
class DnsClient default
class Microsoft.Extensions.DependencyInjection.Abstractions default
class Microsoft.Extensions.Logging.Abstractions default
class Microsoft.Win32.Registry default
class MongoDB.Bson default
class MongoDB.Driver default
class MongoDB.Driver.Core default
class MongoDB.Libmongocrypt default
class SharpCompress default
class Snappier default
class System.Runtime.CompilerServices.Unsafe default
class System.Security.AccessControl default
class System.Security.Principal.Windows default
class ZstdSharp.Port default
